# Exercise 4.6 - Combining & Exporting Data Part 2

## This script contains:
#### 01. Task steps part II (#3-8)
#### 02. Task step 3
#### 03. Task step 4
#### 04. Task step 5
#### 05. Task step 6
#### 06. Task step 7

# 01. Task steps part II (#3-7)

## Importing libraries

In [1]:
# import libraries

import pandas as pd
import numpy as np
import os

## Importing data

In [2]:
# creating path to Instacart folder

path = r'/Users/eastongorman/Library/CloudStorage/OneDrive-Personal/Data Analytics/06-2023 Instacart Basket Analysis'

In [3]:
# creating products dataframe

df_prods =  pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

# 02. Task step 3

In [4]:
# import the orders_products_combined dataframe from the pickle file

df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

# 03. Task step 4

In [5]:
# check the shape of the imported dataframe

df_ords_prods_combined.shape

(32434489, 12)

### 32,434,489 rows by 12 columns

# 04. Task step 5

In [6]:
# check columns of df_ords_prods_combined

df_ords_prods_combined.head()

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [7]:
# check shape of df_prods

df_prods.shape

(49672, 6)

### 49,672 rows by 6 columns

In [8]:
# check columns of df_prods

df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

### both dataframes have the variable 'product_id' which will be the key to merge the dataframes

In [9]:
# drop existing merge column in combined dataframe to create new one in merged dataframe
# dropped due to error in following code to merge

df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

In [10]:
# merging dataframes

df_merged = df_ords_prods_combined.merge(df_prods, on = 'product_id', indicator = True)

In [11]:
df_merged.head()

,Unnamed: 0.1,Unnamed: 0_x,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,Unnamed: 0_y,product_name,aisle_id,department_id,prices,_merge
0,0,0,2539329,1,1,2,8,NaN,196,1,0,195,Soda,77,7,9.0,both
1,1,1,2398795,1,2,3,7,15.0,196,1,1,195,Soda,77,7,9.0,both
2,2,2,473747,1,3,3,12,21.0,196,1,1,195,Soda,77,7,9.0,both
3,3,3,2254736,1,4,4,7,29.0,196,1,1,195,Soda,77,7,9.0,both
4,4,4,431534,1,5,4,15,28.0,196,1,1,195,Soda,77,7,9.0,both

In [12]:
# Drop first 2 unneccesary columns

df_merged = df_merged.drop(columns = ['Unnamed: 0.1','Unnamed: 0_x'])

In [13]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,Unnamed: 0_y,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,195,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,195,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,195,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,195,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,195,Soda,77,7,9.0,both

# 05. Task step 6

In [14]:
# confirm results of the merge using the merge flag

df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

### All rows in new dataframe have a value of both.

In [15]:
df_merged.shape

(32404859, 15)

### 32,404,859 rows by 15 columns

# 06. Task step 7

In [16]:
# export merged dataframe as pickle file

df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_merged.pkl'))